Documents/DMS_РекламнаяКампания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_РекламнаяКампания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.DMS_РекламныеКампанииПредставителей</xr:Item>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРазмещенияМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМедиаРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ФорматыМедиаРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКампании</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимостьВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/DMS_ВидыОперацийРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВидыОперацийРекламнойКампании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СозданиеШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКампании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_РекламнаяКампания/Ext/ManagerModule.bsl
////#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Свойство("Ссылка") И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Ссылка.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	//Если ВидФормы = "ФормаОбъекта" 
	//	И ПараметрыСеанса.DMS_ВидОперацииРекламнойКампании = Перечисления.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании Тогда
	//
	//	СтандартнаяОбработка = Ложь;
	//	ВыбраннаяФорма = "ФормаПомощникСоздания";
	//
	//КонецЕсли; 
	
КонецПроцедуры

////#КонецОбласти

////#Область СлужебныеПроцедурыИФункции

////#Область Проведение   

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// 
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	                      
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса  ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаВтТаблицаРекламныеКампании(), 			   "ТаблицаРекламныеКампании");
	ТекстыЗапроса.Добавить(ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей(), "ТаблицаРекламныеКампанииПредставителей");
	
	DMS_РекламныеКампанииСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры                                       

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РекламнаяКампания.ДатаНачала КАК Период,
		|	РекламнаяКампания.Ссылка КАК Ссылка,
		|	РекламнаяКампания.Представитель КАК Представитель,
		|	РекламнаяКампания.ДилерскийЦентр КАК ДилерскийЦентр,
		|	РекламнаяКампания.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РекламнаяКампания.Валюта КАК Валюта,
		|	РекламнаяКампания.СуммаДокумента КАК СуммаДокумента,
		|	РекламнаяКампания.ТипКампании КАК ТипКампании,
		|	РекламнаяКампания.Ссылка КАК РекламнаяКампания,
		|	РекламнаяКампания.ДатаОкончания КАК ПериодЗавершения,
		|	РекламнаяКампания.ВидОперации КАК ВидОперации,
		|	РекламнаяКампания.Статус КАК Статус
		|ИЗ
		|	Документ.DMS_РекламнаяКампания КАК РекламнаяКампания
		|ГДЕ
		|	РекламнаяКампания.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Коэффициенты = DMS_РаботаСКурсамиВалют.ПолучитьКоэффициентыПересчетаВалюты(Реквизиты.Валюта, Реквизиты.ВалютаВзаиморасчетов, Реквизиты.Период);
	
	СтруктураПараметров = Новый Структура;
	
	Для А = 0 По Запрос.Выполнить().Колонки.Количество()-1 Цикл
		СтруктураПараметров.Вставить(Запрос.Выполнить().Колонки[А].Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров,Реквизиты);
	
	Для каждого Параметр Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);	
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУПР",           Коэффициенты.КоэффициентПересчетаВВалютуУПР);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуРегл",          Коэффициенты.КоэффициентПересчетаВВалютуРегл);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуВзаиморасчетов",Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", 		  Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",               Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРекламныеКампании()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Представитель КАК Представитель,
		|	&ВалютаВзаиморасчетов КАК Валюта,
		|	&ДилерскийЦентр КАК ДилерскийЦентр,
		|	&ТипКампании КАК ТипКампании,
		|	&РекламнаяКампания КАК РекламнаяКампания, 
		|	Модели.Модель КАК Модель,
		|	Модели.ПлановаяСтоимостьВзаиморасчеты КАК СуммаПлан,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета И &Валюта <> &ВалютаРегламентированногоУчета
		|			ТОГДА Модели.ПлановаяСтоимостьВзаиморасчеты
		|			ИНАЧЕ ВЫРАЗИТЬ(Модели.ПлановаяСтоимость * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПланРегл,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|			ТОГДА Модели.ПлановаяСтоимостьВзаиморасчеты
		|			ИНАЧЕ ВЫРАЗИТЬ(Модели.ПлановаяСтоимость * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПланУпр
		|ИЗ
		|	Документ.DMS_РекламнаяКампания.Модели КАК Модели
		|ГДЕ
		|	Модели.Ссылка = &Ссылка
		|	И &ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийРекламнойКампании.РазмещениеКампании)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВтТаблицаБрониНомерногоФонда()

Функция ТекстЗапросаВтТаблицаРекламныеКампанииПредставителей()     
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&ПериодЗавершения КАК ПериодЗавершения,
		|	&Ссылка КАК Регистратор,
		|	&Представитель КАК Представитель,
		|	&РекламнаяКампания КАК РекламнаяКампания,
		|	&Статус КАК Статус
		|ГДЕ
		|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийРекламнойКампании.СозданиеШаблона)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВтТаблицаБрониНомерногоФонда()

////#КонецОбласти

////#КонецОбласти

#КонецЕсли
